[
  {
    "id": "6729871092",
    "title": "The Pope: Francis, Benedict, and the Decision That Shook the World",
    "author_firstname": "Anthony",
    "author_lastname": "McCarten",
    "marketing_message": null,
    "synopsis": "In February 2013, the arch-conservative Pope Benedict XVI made a startling announcement: he would resign, making him the first pope to willingly vacate his office in over 700 years. Reeling from the news, the College of Cardinals rushed to Rome to congregate in the Sistine Chapel to pick his successor. Their unlikely choice? Francis, the first non-European pope in 1,200 years, a one time tango club bouncer, a passionate soccer fan, a man with the common touch.\nWhy did Benedict walk away at the height of power, knowing his successor might be someone whose views might undo his legacy? How did Francis - who used to ride the bus to work back in his native Buenos Aires - adjust to life as leader to a billion followers? If, as the Church teaches, the pope is infallible, how can two living popes who disagree on almost everything both be right? Having immersed himself in these men's lives to write the screenplay for the upcoming motion picture The Pope, Anthony McCarten masterfully weaves their stories into one gripping narrative. From Benedict and Francis's formative experiences in war-torn Germany and Argentina to the sexual abuse scandal that continues to rock the Church to its foundations to the intrigue and the occasional comedy of life in the Vatican, The Pope glitters with the darker and the lighter details of one of the world's most opaque but significant institutions."
  },
  {
    "id": "3498731929",
    "title": "The Dumb Things Smart People Do with Their Money: Thirteen Ways to Right Your Financial Wrongs",
    "author_firstname": "Jill",
    "author_lastname": "Schlesinger",
    "marketing_message": "Get control of your financial life",
    "synopsis": "Do you have a \"friend\" who is super smart, has a great career, holds a graduate degree, has even saved a chunk of money for retirement, but who keeps making the same dumb mistakes when it comes to money? Is this “friend” you?\nAfter decades working as a Wall Street trader, investment adviser, and money expert for CBS, Jill Schlesinger reveals thirteen costly mistakes you’re probably making right now with your money without even knowing it. Drawing on heartfelt personal stories (yes, money experts screw up, too), Schlesinger argues that it’s not lack of smarts that causes even the brightest, most accomplished people among us to behave like financial dumb-asses, but simple emotional blind spots. So if you’ve made well-intentioned mistakes like saving for college for your kids before you’ve saved for your own retirement, or taken on too much risk when you invest, you’ve come to the right place. And if you’ve avoided uncomfortable moments such as sitting down to draft a will or planning long-term care for an aging parent, this is the book for you. \nBy breaking bad habits and following Schlesinger’s pragmatic and accessible rules for managing your finances, you can save tens, even hundreds, of thousands of dollars, not to mention avoid countless sleepless nights.\nPractical, no-nonsense, and often counterintuitive, The Dumb Things Smart People Do with Their Money tells you what you really need to hear about retirement, college financing, insurance, real estate, and more. It might just be the smartest investment you make all year."
  },
  {
    "id": "4313381192",
    "title": "The Personality Brokers: The Strange History of Myers-Briggs and the Birth of Personality Testing",
    "author_firstname": "Merve",
    "author_lastname": "Emre",
    "marketing_message": null,
    "synopsis": "An unprecedented history of the personality test conceived a century ago by a mother and her daughter--fiction writers with no formal training in psychology--and how it insinuated itself into our boardrooms, classrooms, and beyond\nThe Myers-Briggs Type Indicator is the most popular personality test in the world. It is used regularly by Fortune 500 companies, universities, hospitals, churches, and the military. Its language of personality types--extraversion and introversion, sensing and intuiting, thinking and feeling, judging and perceiving--has inspired television shows, online dating platforms, and Buzzfeed quizzes. Yet despite the test's widespread adoption, experts in the field of psychometric testing, a $2 billion industry, have struggled to validate its results--no less account for its success. How did Myers-Briggs, a homegrown multiple choice questionnaire, infiltrate our workplaces, our relationships, our Internet, our lives? \nFirst conceived in the 1920s by the mother-daughter team of Katherine Briggs and Isabel Briggs Myers, a pair of devoted homemakers, novelists, and amateur psychoanalysts, Myers-Briggs was designed to bring the gospel of Carl Jung to the masses. But it would take on a life entirely its own, reaching from the smoke-filled boardrooms of mid-century New York to Berkeley, California, where it was administered to some of the twentieth century's greatest creative minds. It would travel across the world to London, Zurich, Cape Town, Melbourne, and Tokyo, until it could be found just as easily in elementary schools, nunneries, and wellness retreats as in shadowy political consultancies and on social networks.\nDrawing from original reporting and never-before-published documents, The Personality Brokers takes a critical look at the personality indicator that became a cultural icon. Along the way it examines nothing less than the definition of the self--our attempts to grasp, categorize, and quantify our personalities. Surprising and absorbing, the book, like the test at its heart, considers the timeless question: What makes you, you?"
  },
  {
    "id": "7651528875",
    "title": "The Friendly Orange Glow: The Untold Story of the Rise of Cyberculture",
    "author_firstname": "Brian",
    "author_lastname": "Dear",
    "marketing_message": "Remember when nerds were nerds and.. um.  This book is about some nerds",
    "synopsis": "At a time when Steve Jobs was only a teenager and Mark Zuckerberg wasn’t even born, a group of visionary engineers and designers—some of them only high school students—in the late 1960s and 1970s created a computer system called PLATO, which was light-years ahead in experimenting with how people would learn, engage, communicate, and play through connected computers. Not only did PLATO engineers make significant hardware breakthroughs with plasma displays and touch screens but PLATO programmers also came up with a long list of software innovations: chat rooms, instant messaging, message boards, screen savers, multiplayer games, online newspapers, interactive fiction, and emoticons. Together, the PLATO community pioneered what we now collectively engage in as cyberculture. They were among the first to identify and also realize the potential and scope of the social interconnectivity of computers, well before the creation of the internet. PLATO was the foundational model for every online community that was to follow in its footsteps.\nThe Friendly Orange Glow is the first history to recount in fascinating detail the remarkable accomplishments and inspiring personal stories of the PLATO community. The addictive nature of PLATO both ruined many a college career and launched pathbreaking multimillion-dollar software products. Its development, impact, and eventual disappearance provides an instructive case study of technological innovation and disruption, project management, and missed opportunities. Above all, The Friendly Orange Glow at last reveals new perspectives on the origins of social computing and our internet-infatuated world."
  },
  {
    "id": "111133311",
    "title": "The Life-Changing Magic of Tidying Up: The Japanese Art of Decluttering and Organizing",
    "author_firstname": "Marie",
    "author_lastname": "Kondo",
    "marketing_message": null,
    "synopsis": "Despite constant efforts to declutter your home, do papers still accumulate like snowdrifts and clothes pile up like a tangled mess of noodles?\nJapanese cleaning consultant Marie Kondo takes tidying to a whole new level, promising that if you properly simplify and organize your home once, you’ll never have to do it again. Most methods advocate a room-by-room or little-by-little approach, which doom you to pick away at your piles of stuff forever. The KonMari Method, with its revolutionary category-by-category system, leads to lasting results. In fact, none of Kondo’s clients have lapsed (and she still has a three-month waiting list).\nWith detailed guidance for determining which items in your house “spark joy” (and which don’t), this international bestseller featuring Tokyo’s newest lifestyle phenomenon will help you clear your clutter and enjoy the unique magic of a tidy home—and the calm, motivated mindset it can inspire."
  }
]
